console.log('number' + 3 + 3); // number33  -->  якщо між значеннями різних типів стоїть знак '+', JS об'єднує такі значення в одне. (concatenation)
 console.log(null + 3); // 3  -->  null являється відсутністю значення, тому відповідь - просто 3.
 console.log(5 && "qwerty"); /* qwerty  -->  оператор && повертає або перше значення, якщо воно False, або друге значення, якщо воно True.
                            В даному прикладі, обадва значення є True. */
 console.log(+'40' + +'2' + "hillel"); /* 42hillel  -->  символ '+' перед стрінгою, що містить лише цифри, переводить її у формат числа. 
                                        Далі відбувається математична операція додавання і конкатинація з рядком "hillel". */
 console.log('10' - 5 === 6); /* false  -->  рядок '10' претворюється у число для математичного розахунку 10-5. Далі іде порівняння.
                                Число 5 не може строго дорівнювати числу 6. */
 console.log(true + false); // 1  -->  JS сприймає значення true, як одиницю, а false, як нуль.
 console.log('4px' - 3); // NaN  -->  '4px' містить буквенні символи і являється стрінгою (Not_a_Number), а отже, віднімання не можливе.
 console.log('4' - 3); // 1  -->  JS сприймає цифру '4', записану в строку без інших символів, як число і проводить операцію з віднімання.
 console.log('6' + 3 ** 0); // 61  -->  математична операція - 3 в степені 0 дорівнює 1. Далі JS проводить конкатенацію значень різних типів.
 console.log(12 / '6'); // 2  -->  JS сприймає цифру '6', записану в строку без інших символів, як число і проводить операцію з ділення.
 console.log('10' + (5 === 6)); /* 10false  -->  порядок виконання, згідно математичного правила - спершу виконується задача в дужках,
                                потім наступні операції. 5 строго дорівнює 6 повертає значення false.
                                Далі виконується конкатенація значень різних типів. */
 console.log(null == ''); // false  -->  відсутність значення null не дорівнює порожньому значенню рядка.
 console.log(3 ** (9 / 3)); // 27  -->  класична математична операція. 9 ділимо на 3 - отримуємо 3. А 3 в кубі дорівнює 27.
 console.log(!!'false' == !!'true'); // true
 console.log(0 || '0' && 1); // 1
 console.log((+null == false) < 1); // false
 console.log(false && true || true); // true
 console.log(false && (false || true)); // false
 console.log((+null == false) < 1 ** 5); // false